; domain
(define (domain cell-assembly-anywhere)
  (:requirements :strips :typing
		 :negative-preconditions
		 :action-costs)
  (:types arm		       ;
	  position	       ; Where the arms is potentially able to go
	  holdable
	  job - object
	  
	  table - position     ; The place to attach components with arms.
	  container - position ; Has infinite capacity to store things.
	  
	  conveyor - container ; Slide things in/away. Infinite length.
	  tray - container     ; Part trays.
	  
	  machine - table      ; Tables which does specific jobs by itself.
	  machine-job - job    ; Jobs which should be done on machines.
	  base - holdable      ;
	  component - holdable ; Things which should be attatched on tables.
	  )
  (:constants carry-in - conveyor  ; the start of the base
	      carry-out - conveyor ; the goal of the base
	      table-in - table	   ; always connected to the conveyor
	      table-out - table	   ; always connected to the conveyor
	      nothing-done - job)  ; general start state of any base
  (:predicates 

   ;; arm attributes
   (reachable ?arm - arm ?to - position)
   ;; position attributes
   (adjacent ?from ?to - position)
   (connected ?from ?to - position) ;; by conveyor
   ;; job attributes
   (depends ?prev-job ?job - job)
   (job-available-at ?job - job ?pos - table)
   (uses ?job - job ?component - component)
   
   ;; state description
   (at ?obj - object ?pos - position)
   (arm-present ?pos - position)
   (base-present ?pos - position)
   
   (hold ?arm - arm ?holdable - holdable)
   (free ?arm - arm) ;; instead of (not (exists (?base) (hold ?arm ?base)))

   ;; (used ?component - component)
   
   (finished ?job - job ?base - base))

  (:functions
   (total-cost)
   (loading-cost)        ; the cost to set and eject base
   (job-cost ?job - job) ; the cost to do each job
   
   ;; slidng bases costs nothing

   (move-cost ?from ?to - position) - number)

  ;; arm is irrelevant
  (:action slide-base-in
	   ;; Slide Base: Uses a slide device to move a base. 
	   ;; MOD : CARRY-IN device only.
	   ;; MOD : It DOES care if the destination is already used.
	   :parameters (?base - base ?from - conveyor ?to - table)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to)
			      (not (base-present ?to)))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(base-present ?to)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-out
	   ;; Slide Base: Uses a slide device to move a base. 
	   ;; MOD : CARRY-OUT device only.
	   ;; MOD : It doesn't care if the destination is already used.
	   ;; MOD : After the action the base acts like it had disappeard.
	   :parameters (?base - base ?from - table ?to - conveyor)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(not (base-present ?from))
			(increase (total-cost) (loading-cost))))

  
  (:action assemble-with-machine
	   ;; Base Assemble by Machine: Use a machine (?pos) to
	   ;; perform an assembly operation (e.g., tighten the screw) on
	   ;; a base (?base).

	   ;; The ordering constraints which are determined when the
	   ;; object is designed are encoded as a set of ordering proposi-
	   ;; tions, finished_Step_X and unfihished_Step_X, which rep-
	   ;; resent whether an assembly step X has been performed
	   ;; already.
	   :parameters (?base - base
			?machine - machine
			?job - machine-job
			?prev-job - job)
	   :precondition (and ;; machine specification
			  (job-available-at ?job ?machine)
			  ;; state specification
			  (not (finished ?job ?base))
			  (at ?base ?machine)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(increase (total-cost) (job-cost ?job))))
  
  ;; requires arm in use
  (:action move-arm
	   ;;   Moves the arm (?arm) from the source
	   ;; (?from) to the destination (?to). The occupied and not-
	   ;; occupied propositions enforce a mutual exclusion con-
	   ;; straint so that only one arm can occupy any given location
	   ;; at a time.
	   :parameters (?arm - arm ?from - position ?to - position)
	   :precondition (and (at ?arm ?from)
			      (not (arm-present ?to))
			      (adjacent ?from ?to)
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))
  
  ;; acquire arm mutex
  (:action eject-base
	   ;; Eject Base: Uses an arm (?arm) to grasp and pick up a
	   ;; base (?base) from a machine or a table (?pos). Resets
	   ;; the mutual exclusion constraint enforcing the rule that
	   ;; at most 1 base can be at a location (notbaseplaced ?pos)
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (at ?base ?pos)
			      ;;(at ?arm ?pos) ;; !! removed for the concurrency
			      (free ?arm))
	   :effect (and (hold ?arm ?base)
			
			(at ?arm ?pos)
			(arm-present ?pos)
			;; !! added for the concurrency.
			;; !! the arm moves to the position unconditionally.

			(not (free ?arm))
			(not (base-present ?pos))
			(not (at ?base ?pos))
			(increase (total-cost) (loading-cost))))
  
  ;; acquire arm mutex
  (:action pickup-component
	   ;; Pick Parts by Arm: Use an arm (?arm) to pick up a part
	   ;; (?part). The part will later be used by a BaseAssem-
	   ;; blePickedPartsXByArm action (see below).
	   ;; 
	   ;; NOTE: basically, we assume there are unlimited number of
	   ;; components in trays. That's why this action lacks the
	   ;; delete effect on the place of the component.
	   :parameters (?component - component ?arm - arm ?pos - tray)
	   :precondition (and (free ?arm)
			      ;;(at ?arm ?pos) ;; !! removed for the concurrency
			      (at ?component ?pos))
	   :effect (and (hold ?arm ?component)
			
			(at ?arm ?pos)
			(arm-present ?pos)
			;; !! added for the concurrency.
			;; !! the arm moves to the position unconditionally.
			
			(not (free ?arm))
			(increase (total-cost) (loading-cost))))

  ;; release arm mutex
  (:action set-base
	   ;; Set Base: Commands an arm (?arm) that is holding
	   ;; a particular base (?base) to set the base on a machine
	   ;; or table (?pos). Each machine/table has a mutual
	   ;; exclusion constraint ensuring at most 1 base is placed
	   ;; on it (notbaseplaced).
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (hold ?arm ?base)
			      (at ?arm ?pos)
			      (not (base-present ?pos)))
	   :effect (and (at ?base ?pos)
			(free ?arm)
			
			(not (at ?arm ?pos))
			(not (arm-present ?pos))
			;; !! added for the concurrency.
			;; !! the arm moves to the position unconditionally.
			
			(not (hold ?arm ?base))
			(base-present ?pos)
			(increase (total-cost) (loading-cost))))
  
  ;; release arm mutex
  (:action assemble-with-arm
	   ;; Base Assemble Picked Parts by Arm: Uses an arm
	   ;; (?arm) to attach a part (?part) to a base.
	   ;; 
	   ;; NOTE: components are not distinguished between each
	   ;;       other
	   :parameters (?component - component
			?job ?prev-job - job
			?base - base
			?arm - arm
			?pos - table)
	   :precondition (and
			  ;; job specification
			  (job-available-at ?job ?pos)
			  (uses ?job ?component)
			  ;; state specification
			  (hold ?arm ?component)
			  (at ?arm ?pos)
			  (at ?base ?pos)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(free ?arm)
			
			(not (at ?arm ?pos))
			(not (arm-present ?pos))
			;; !! added for the concurrency.
			;; !! the arm moves to the position unconditionally.
			
			(not (hold ?arm ?component))
			(increase (total-cost) (job-cost ?job)))))

; problem
(define (problem cell-assembly-anywhere-p3)
  (:domain cell-assembly-anywhere)
  (:objects arm - arm
	    b1 b2 b3 - base
	    part-a
	    part-b
	    part-c - component
	    
	    tray-a
	    tray-b
	    tray-c - tray
	    
	    table2 - table
	    
	    machine-a
	    machine-b - machine
	    attatch-a
	    attatch-b
	    attatch-c - job
	    screw-a
	    screw-c - machine-job
	    )
    (:init
   ;;;;;;;;;;;;;;;; ATTRIBUTES ;;;;;;;;;;;;;;;;
   ;; 
   ;; cost initialization
   (= (total-cost) 0)   ; !!! do not remove this
   (= (loading-cost) 1) ; !!! do not remove this

   ;; arm attributes
   ;; (make-reachable 'arm '(table-in
   ;; 			  tray-a
   ;; 			  machine-a
   ;; 			  tray-b
   ;; 			  table2
   ;; 			  tray-c
   ;; 			  machine-b
   ;; 			  table-out))
   (REACHABLE ARM TABLE-IN) 
   (REACHABLE ARM TABLE-OUT) 
   (REACHABLE ARM TRAY-A) 
   (REACHABLE ARM TRAY-B) 
   (REACHABLE ARM TRAY-C) 
   (REACHABLE ARM TABLE2) 
   (REACHABLE ARM MACHINE-A) 
   (REACHABLE ARM MACHINE-B)

   ;; position attributes
   ;; (make-dists2  '(table-in
   ;; 		   tray-a
   ;; 		   machine-a
   ;; 		   tray-b
   ;; 		   table2
   ;; 		   tray-c
   ;; 		   machine-b
   ;; 		   table-out))

   (= (MOVE-COST TABLE-IN TRAY-A) 2) 
   (= (MOVE-COST TRAY-A TABLE-IN) 2) 
   (ADJACENT TABLE-IN TRAY-A) 
   (ADJACENT TRAY-A TABLE-IN) 
   (= (MOVE-COST TRAY-A MACHINE-A) 4) 
   (= (MOVE-COST MACHINE-A TRAY-A) 4) 
   (ADJACENT TRAY-A MACHINE-A) 
   (ADJACENT MACHINE-A TRAY-A) 
   (= (MOVE-COST MACHINE-A TRAY-B) 1) 
   (= (MOVE-COST TRAY-B MACHINE-A) 1) 
   (ADJACENT MACHINE-A TRAY-B) 
   (ADJACENT TRAY-B MACHINE-A) 
   (= (MOVE-COST TRAY-B TABLE2) 3) 
   (= (MOVE-COST TABLE2 TRAY-B) 3) 
   (ADJACENT TRAY-B TABLE2) 
   (ADJACENT TABLE2 TRAY-B) 
   (= (MOVE-COST TABLE2 TRAY-C) 2) 
   (= (MOVE-COST TRAY-C TABLE2) 2) 
   (ADJACENT TABLE2 TRAY-C) 
   (ADJACENT TRAY-C TABLE2) 
   (= (MOVE-COST TRAY-C MACHINE-B) 1) 
   (= (MOVE-COST MACHINE-B TRAY-C) 1) 
   (ADJACENT TRAY-C MACHINE-B) 
   (ADJACENT MACHINE-B TRAY-C) 
   (= (MOVE-COST MACHINE-B TABLE-OUT) 1) 
   (= (MOVE-COST TABLE-OUT MACHINE-B) 1) 
   (ADJACENT MACHINE-B TABLE-OUT) 
   (ADJACENT TABLE-OUT MACHINE-B) 
   (= (MOVE-COST TABLE-IN MACHINE-A) 1000) 
   (= (MOVE-COST MACHINE-A TABLE-IN) 1000) 
   (= (MOVE-COST TABLE-IN TRAY-B) 1000) 
   (= (MOVE-COST TRAY-B TABLE-IN) 1000) 
   (= (MOVE-COST TABLE-IN TABLE2) 1000) 
   (= (MOVE-COST TABLE2 TABLE-IN) 1000) 
   (= (MOVE-COST TABLE-IN TRAY-C) 1000) 
   (= (MOVE-COST TRAY-C TABLE-IN) 1000) 
   (= (MOVE-COST TABLE-IN MACHINE-B) 1000) 
   (= (MOVE-COST MACHINE-B TABLE-IN) 1000) 
   (= (MOVE-COST TABLE-IN TABLE-OUT) 1000) 
   (= (MOVE-COST TABLE-OUT TABLE-IN) 1000) 
   (= (MOVE-COST TRAY-A TRAY-B) 1000) 
   (= (MOVE-COST TRAY-B TRAY-A) 1000) 
   (= (MOVE-COST TRAY-A TABLE2) 1000) 
   (= (MOVE-COST TABLE2 TRAY-A) 1000) 
   (= (MOVE-COST TRAY-A TRAY-C) 1000) 
   (= (MOVE-COST TRAY-C TRAY-A) 1000) 
   (= (MOVE-COST TRAY-A MACHINE-B) 1000) 
   (= (MOVE-COST MACHINE-B TRAY-A) 1000) 
   (= (MOVE-COST TRAY-A TABLE-OUT) 1000) 
   (= (MOVE-COST TABLE-OUT TRAY-A) 1000) 
   (= (MOVE-COST MACHINE-A TABLE2) 1000) 
   (= (MOVE-COST TABLE2 MACHINE-A) 1000) 
   (= (MOVE-COST MACHINE-A TRAY-C) 1000) 
   (= (MOVE-COST TRAY-C MACHINE-A) 1000) 
   (= (MOVE-COST MACHINE-A MACHINE-B) 1000) 
   (= (MOVE-COST MACHINE-B MACHINE-A) 1000) 
   (= (MOVE-COST MACHINE-A TABLE-OUT) 1000) 
   (= (MOVE-COST TABLE-OUT MACHINE-A) 1000) 
   (= (MOVE-COST TRAY-B TRAY-C) 1000) 
   (= (MOVE-COST TRAY-C TRAY-B) 1000) 
   (= (MOVE-COST TRAY-B MACHINE-B) 1000) 
   (= (MOVE-COST MACHINE-B TRAY-B) 1000) 
   (= (MOVE-COST TRAY-B TABLE-OUT) 1000) 
   (= (MOVE-COST TABLE-OUT TRAY-B) 1000) 
   (= (MOVE-COST TABLE2 MACHINE-B) 1000) 
   (= (MOVE-COST MACHINE-B TABLE2) 1000) 
   (= (MOVE-COST TABLE2 TABLE-OUT) 1000) 
   (= (MOVE-COST TABLE-OUT TABLE2) 1000) 
   (= (MOVE-COST TRAY-C TABLE-OUT) 1000) 
   (= (MOVE-COST TABLE-OUT TRAY-C) 1000) 
   (= (MOVE-COST TABLE-IN TABLE-IN) 1000) 
   (= (MOVE-COST TRAY-A TRAY-A) 1000) 
   (= (MOVE-COST MACHINE-A MACHINE-A) 1000) 
   (= (MOVE-COST TRAY-B TRAY-B) 1000) 
   (= (MOVE-COST TABLE2 TABLE2) 1000) 
   (= (MOVE-COST TRAY-C TRAY-C) 1000) 
   (= (MOVE-COST MACHINE-B MACHINE-B) 1000) 
   (= (MOVE-COST TABLE-OUT TABLE-OUT) 1000) 
   
   ;; conveyor attributes
   (connected carry-in table-in)   ; !!! do not remove this
   (connected table-out carry-out) ; !!! do not remove this

   ;; job and component attributes

   ;; (make-linear-jobs
   ;;  '((attatch-a table-in part-a tray-a)
   ;;    (screw-a machine-a)
   ;;    (attatch-b table2 part-b tray-b)
   ;;    (attatch-c table2 part-c tray-c)
   ;;    (screw-c machine-b)))

   (= (JOB-COST NOTHING-DONE) 0) 
   (JOB-AVAILABLE-AT ATTATCH-A TABLE-IN) 
   (DEPENDS NOTHING-DONE ATTATCH-A) 
   (= (JOB-COST ATTATCH-A) 18) 
   (USES ATTATCH-A PART-A) 
   (AT PART-A TRAY-A) 
   (JOB-AVAILABLE-AT SCREW-A MACHINE-A) 
   (DEPENDS ATTATCH-A SCREW-A) 
   (= (JOB-COST SCREW-A) 18) 
   (JOB-AVAILABLE-AT ATTATCH-B TABLE2) 
   (DEPENDS SCREW-A ATTATCH-B) 
   (= (JOB-COST ATTATCH-B) 13) 
   (USES ATTATCH-B PART-B) 
   (AT PART-B TRAY-B) 
   (JOB-AVAILABLE-AT ATTATCH-C TABLE2) 
   (DEPENDS ATTATCH-B ATTATCH-C) 
   (= (JOB-COST ATTATCH-C) 28) 
   (USES ATTATCH-C PART-C) 
   (AT PART-C TRAY-C) 
   (JOB-AVAILABLE-AT SCREW-C MACHINE-B) 
   (DEPENDS ATTATCH-C SCREW-C) 
   (= (JOB-COST SCREW-C) 38) 
   
   ;;;;;;;;;;;;;;;; INITIAL STATES ;;;;;;;;;;;;;;;;
   ;; 
   ;;;; Bases ;;;;;;;;;
   ;; 
   ;; All bases are at CARRY-IN
   ;; Base and jobs. All bases must have finished NOTHING-DONE

   ;; (make-initial-bases '(b1))

   (AT B1 CARRY-IN) 
   (FINISHED NOTHING-DONE B1) 
   (AT B2 CARRY-IN) 
   (FINISHED NOTHING-DONE B2) 
   (AT B3 CARRY-IN) 
   (FINISHED NOTHING-DONE B3) 

   ;;;; Arms ;;;;;;;;;;;;;;;;
   (free arm))
  (:goal (and
	  ;; In the goal state, all bases should be at CARRY-OUT
	  (at b1 carry-out)
	  (at b2 carry-out)
	  (at b3 carry-out)
	  
	  ;; Also, all base should already passed the last job.
	  (finished screw-c b1)
	  (finished screw-c b2)
	  (finished screw-c b3)
	  ))
  (:metric minimize (total-cost)))

; plan
1. (slide-base-in b3 carry-in table-in)
   deleted: (at b3 carry-in)
   added: (at b3 table-in) (base-present table-in)
   goals met: 0 of 6
2. (pickup-component part-a arm tray-a)
   deleted: (free arm)
   added: (hold arm part-a) (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 6
3. (move-arm arm tray-a table-in)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 6
4. (assemble-with-arm part-a attatch-a nothing-done b3 arm table-in)
   deleted: (at arm table-in) (arm-present table-in) (hold arm part-a)
   added: (finished attatch-a b3) (free arm)
   goals met: 0 of 6
5. (eject-base b3 arm table-in)
   deleted: (free arm) (base-present table-in) (at b3 table-in)
   added: (hold arm b3) (at arm table-in) (arm-present table-in)
   goals met: 0 of 6
6. (slide-base-in b1 carry-in table-in)
   deleted: (at b1 carry-in)
   added: (at b1 table-in) (base-present table-in)
   goals met: 0 of 6
7. (move-arm arm table-in tray-a)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 6
8. (move-arm arm tray-a machine-a)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm machine-a) (arm-present machine-a)
   goals met: 0 of 6
9. (set-base b3 arm machine-a)
   deleted: (at arm machine-a) (arm-present machine-a) (hold arm b3)
   added: (at b3 machine-a) (free arm) (base-present machine-a)
   goals met: 0 of 6
10. (assemble-with-machine b3 machine-a screw-a attatch-a)
   added: (finished screw-a b3)
   goals met: 0 of 6
11. (eject-base b3 arm machine-a)
   deleted: (free arm) (base-present machine-a) (at b3 machine-a)
   added: (hold arm b3) (at arm machine-a) (arm-present machine-a)
   goals met: 0 of 6
12. (move-arm arm machine-a tray-b)
   deleted: (at arm machine-a) (arm-present machine-a)
   added: (at arm tray-b) (arm-present tray-b)
   goals met: 0 of 6
13. (move-arm arm tray-b table2)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table2) (arm-present table2)
   goals met: 0 of 6
14. (set-base b3 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm b3)
   added: (at b3 table2) (free arm) (base-present table2)
   goals met: 0 of 6
15. (pickup-component part-b arm tray-b)
   deleted: (free arm)
   added: (hold arm part-b) (at arm tray-b) (arm-present tray-b)
   goals met: 0 of 6
16. (move-arm arm tray-b table2)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table2) (arm-present table2)
   goals met: 0 of 6
17. (assemble-with-arm part-b attatch-b screw-a b3 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm part-b)
   added: (finished attatch-b b3) (free arm)
   goals met: 0 of 6
18. (pickup-component part-a arm tray-a)
   deleted: (free arm)
   added: (hold arm part-a) (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 6
19. (move-arm arm tray-a table-in)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 6
20. (assemble-with-arm part-a attatch-a nothing-done b1 arm table-in)
   deleted: (at arm table-in) (arm-present table-in) (hold arm part-a)
   added: (finished attatch-a b1) (free arm)
   goals met: 0 of 6
21. (eject-base b1 arm table-in)
   deleted: (free arm) (base-present table-in) (at b1 table-in)
   added: (hold arm b1) (at arm table-in) (arm-present table-in)
   goals met: 0 of 6
22. (slide-base-in b2 carry-in table-in)
   deleted: (at b2 carry-in)
   added: (at b2 table-in) (base-present table-in)
   goals met: 0 of 6
23. (move-arm arm table-in tray-a)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 6
24. (move-arm arm tray-a machine-a)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm machine-a) (arm-present machine-a)
   goals met: 0 of 6
25. (set-base b1 arm machine-a)
   deleted: (at arm machine-a) (arm-present machine-a) (hold arm b1)
   added: (at b1 machine-a) (free arm) (base-present machine-a)
   goals met: 0 of 6
26. (assemble-with-machine b1 machine-a screw-a attatch-a)
   added: (finished screw-a b1)
   goals met: 0 of 6
27. (pickup-component part-a arm tray-a)
   deleted: (free arm)
   added: (hold arm part-a) (at arm tray-a) (arm-present tray-a)
   goals met: 0 of 6
28. (move-arm arm tray-a table-in)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm table-in) (arm-present table-in)
   goals met: 0 of 6
29. (assemble-with-arm part-a attatch-a nothing-done b2 arm table-in)
   deleted: (at arm table-in) (arm-present table-in) (hold arm part-a)
   added: (finished attatch-a b2) (free arm)
   goals met: 0 of 6
30. (pickup-component part-c arm tray-c)
   deleted: (free arm)
   added: (hold arm part-c) (at arm tray-c) (arm-present tray-c)
   goals met: 0 of 6
31. (move-arm arm tray-c table2)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm table2) (arm-present table2)
   goals met: 0 of 6
32. (assemble-with-arm part-c attatch-c attatch-b b3 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm part-c)
   added: (finished attatch-c b3) (free arm)
   goals met: 0 of 6
33. (eject-base b3 arm table2)
   deleted: (free arm) (base-present table2) (at b3 table2)
   added: (hold arm b3) (at arm table2) (arm-present table2)
   goals met: 0 of 6
34. (move-arm arm table2 tray-c)
   deleted: (at arm table2) (arm-present table2)
   added: (at arm tray-c) (arm-present tray-c)
   goals met: 0 of 6
35. (move-arm arm tray-c machine-b)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm machine-b) (arm-present machine-b)
   goals met: 0 of 6
36. (set-base b3 arm machine-b)
   deleted: (at arm machine-b) (arm-present machine-b) (hold arm b3)
   added: (at b3 machine-b) (free arm) (base-present machine-b)
   goals met: 0 of 6
37. (eject-base b1 arm machine-a)
   deleted: (free arm) (base-present machine-a) (at b1 machine-a)
   added: (hold arm b1) (at arm machine-a) (arm-present machine-a)
   goals met: 0 of 6
38. (move-arm arm machine-a tray-b)
   deleted: (at arm machine-a) (arm-present machine-a)
   added: (at arm tray-b) (arm-present tray-b)
   goals met: 0 of 6
39. (move-arm arm tray-b table2)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table2) (arm-present table2)
   goals met: 0 of 6
40. (set-base b1 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm b1)
   added: (at b1 table2) (free arm) (base-present table2)
   goals met: 0 of 6
41. (assemble-with-machine b3 machine-b screw-c attatch-c)
   added: (finished screw-c b3)
   goals met: 1 of 6
42. (eject-base b3 arm machine-b)
   deleted: (free arm) (base-present machine-b) (at b3 machine-b)
   added: (hold arm b3) (at arm machine-b) (arm-present machine-b)
   goals met: 1 of 6
43. (move-arm arm machine-b table-out)
   deleted: (at arm machine-b) (arm-present machine-b)
   added: (at arm table-out) (arm-present table-out)
   goals met: 1 of 6
44. (set-base b3 arm table-out)
   deleted: (at arm table-out) (arm-present table-out) (hold arm b3)
   added: (at b3 table-out) (free arm) (base-present table-out)
   goals met: 1 of 6
45. (slide-base-out b3 table-out carry-out)
   deleted: (at b3 table-out) (base-present table-out)
   added: (at b3 carry-out)
   goals met: 2 of 6
46. (pickup-component part-b arm tray-b)
   deleted: (free arm)
   added: (hold arm part-b) (at arm tray-b) (arm-present tray-b)
   goals met: 2 of 6
47. (move-arm arm tray-b table2)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table2) (arm-present table2)
   goals met: 2 of 6
48. (assemble-with-arm part-b attatch-b screw-a b1 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm part-b)
   added: (finished attatch-b b1) (free arm)
   goals met: 2 of 6
49. (pickup-component part-c arm tray-c)
   deleted: (free arm)
   added: (hold arm part-c) (at arm tray-c) (arm-present tray-c)
   goals met: 2 of 6
50. (move-arm arm tray-c table2)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm table2) (arm-present table2)
   goals met: 2 of 6
51. (assemble-with-arm part-c attatch-c attatch-b b1 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm part-c)
   added: (finished attatch-c b1) (free arm)
   goals met: 2 of 6
52. (eject-base b1 arm table2)
   deleted: (free arm) (base-present table2) (at b1 table2)
   added: (hold arm b1) (at arm table2) (arm-present table2)
   goals met: 2 of 6
53. (move-arm arm table2 tray-c)
   deleted: (at arm table2) (arm-present table2)
   added: (at arm tray-c) (arm-present tray-c)
   goals met: 2 of 6
54. (move-arm arm tray-c machine-b)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm machine-b) (arm-present machine-b)
   goals met: 2 of 6
55. (set-base b1 arm machine-b)
   deleted: (at arm machine-b) (arm-present machine-b) (hold arm b1)
   added: (at b1 machine-b) (free arm) (base-present machine-b)
   goals met: 2 of 6
56. (assemble-with-machine b1 machine-b screw-c attatch-c)
   added: (finished screw-c b1)
   goals met: 3 of 6
57. (eject-base b1 arm machine-b)
   deleted: (free arm) (base-present machine-b) (at b1 machine-b)
   added: (hold arm b1) (at arm machine-b) (arm-present machine-b)
   goals met: 3 of 6
58. (move-arm arm machine-b table-out)
   deleted: (at arm machine-b) (arm-present machine-b)
   added: (at arm table-out) (arm-present table-out)
   goals met: 3 of 6
59. (set-base b1 arm table-out)
   deleted: (at arm table-out) (arm-present table-out) (hold arm b1)
   added: (at b1 table-out) (free arm) (base-present table-out)
   goals met: 3 of 6
60. (eject-base b2 arm table-in)
   deleted: (free arm) (base-present table-in) (at b2 table-in)
   added: (hold arm b2) (at arm table-in) (arm-present table-in)
   goals met: 3 of 6
61. (slide-base-out b1 table-out carry-out)
   deleted: (at b1 table-out) (base-present table-out)
   added: (at b1 carry-out)
   goals met: 4 of 6
62. (move-arm arm table-in tray-a)
   deleted: (at arm table-in) (arm-present table-in)
   added: (at arm tray-a) (arm-present tray-a)
   goals met: 4 of 6
63. (move-arm arm tray-a machine-a)
   deleted: (at arm tray-a) (arm-present tray-a)
   added: (at arm machine-a) (arm-present machine-a)
   goals met: 4 of 6
64. (set-base b2 arm machine-a)
   deleted: (at arm machine-a) (arm-present machine-a) (hold arm b2)
   added: (at b2 machine-a) (free arm) (base-present machine-a)
   goals met: 4 of 6
65. (assemble-with-machine b2 machine-a screw-a attatch-a)
   added: (finished screw-a b2)
   goals met: 4 of 6
66. (eject-base b2 arm machine-a)
   deleted: (free arm) (base-present machine-a) (at b2 machine-a)
   added: (hold arm b2) (at arm machine-a) (arm-present machine-a)
   goals met: 4 of 6
67. (move-arm arm machine-a tray-b)
   deleted: (at arm machine-a) (arm-present machine-a)
   added: (at arm tray-b) (arm-present tray-b)
   goals met: 4 of 6
68. (move-arm arm tray-b table2)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table2) (arm-present table2)
   goals met: 4 of 6
69. (set-base b2 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm b2)
   added: (at b2 table2) (free arm) (base-present table2)
   goals met: 4 of 6
70. (pickup-component part-b arm tray-b)
   deleted: (free arm)
   added: (hold arm part-b) (at arm tray-b) (arm-present tray-b)
   goals met: 4 of 6
71. (move-arm arm tray-b table2)
   deleted: (at arm tray-b) (arm-present tray-b)
   added: (at arm table2) (arm-present table2)
   goals met: 4 of 6
72. (assemble-with-arm part-b attatch-b screw-a b2 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm part-b)
   added: (finished attatch-b b2) (free arm)
   goals met: 4 of 6
73. (pickup-component part-c arm tray-c)
   deleted: (free arm)
   added: (hold arm part-c) (at arm tray-c) (arm-present tray-c)
   goals met: 4 of 6
74. (move-arm arm tray-c table2)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm table2) (arm-present table2)
   goals met: 4 of 6
75. (assemble-with-arm part-c attatch-c attatch-b b2 arm table2)
   deleted: (at arm table2) (arm-present table2) (hold arm part-c)
   added: (finished attatch-c b2) (free arm)
   goals met: 4 of 6
76. (eject-base b2 arm table2)
   deleted: (free arm) (base-present table2) (at b2 table2)
   added: (hold arm b2) (at arm table2) (arm-present table2)
   goals met: 4 of 6
77. (move-arm arm table2 tray-c)
   deleted: (at arm table2) (arm-present table2)
   added: (at arm tray-c) (arm-present tray-c)
   goals met: 4 of 6
78. (move-arm arm tray-c machine-b)
   deleted: (at arm tray-c) (arm-present tray-c)
   added: (at arm machine-b) (arm-present machine-b)
   goals met: 4 of 6
79. (set-base b2 arm machine-b)
   deleted: (at arm machine-b) (arm-present machine-b) (hold arm b2)
   added: (at b2 machine-b) (free arm) (base-present machine-b)
   goals met: 4 of 6
80. (assemble-with-machine b2 machine-b screw-c attatch-c)
   added: (finished screw-c b2)
   goals met: 5 of 6
81. (eject-base b2 arm machine-b)
   deleted: (free arm) (base-present machine-b) (at b2 machine-b)
   added: (hold arm b2) (at arm machine-b) (arm-present machine-b)
   goals met: 5 of 6
82. (move-arm arm machine-b table-out)
   deleted: (at arm machine-b) (arm-present machine-b)
   added: (at arm table-out) (arm-present table-out)
   goals met: 5 of 6
83. (set-base b2 arm table-out)
   deleted: (at arm table-out) (arm-present table-out) (hold arm b2)
   added: (at b2 table-out) (free arm) (base-present table-out)
   goals met: 5 of 6
84. (slide-base-out b2 table-out carry-out)
   deleted: (at b2 table-out) (base-present table-out)
   added: (at b2 carry-out)
   goals met: 6 of 6
